app/controllers/events_controller.rb

INSERT INTO "events" ("event_name", "address", "start_time", "end_time", "price", "description", "tag", "pictures", "available_spots", "occupied_spots", "organizer_id", "applicants_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "available_spots" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["available_spots", 2], ["updated_at", "2022-10-30 19:51:59.872156"], ["id", 34]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)

SELECT "events".* FROM "events" WHERE (available_spots = 0)
---
    def set_event
      @event = Event.find(params[:id])