app/controllers/events_controller.rb

  def show
    id = params[:id]
    @event = Event.find(id)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]

  def create
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      start_time = Time.new *flatten_date_array(params[:event],"start")
      end_time = Time.new *flatten_date_array(params[:event], "end")
      if (end_time < start_time or end_time < Time.now)
        flash[:warning] = "Time invalid!"
        redirect_to events_path
      elsif Integer(params[:event][:available_spots]) < 1
        flash[:warning] = 'At least one available spot.'
        redirect_to events_path
      elsif Integer(params[:event][:occupied_spots]) < 1
        flash[:warning] = 'At least one spot is occupied(by you).'
        redirect_to events_path
      else
        @event = Event.new(event_params)
        @event.user = current_user
        @event.save!
---
INSERT INTO "events" ("event_name", "address", "start_time", "end_time", "price", "description", "tag", "percentage", "pictures", "available_spots", "occupied_spots", "organizer_id", "applicants_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])
    if @event.user == current_user
      start_time = Time.new *flatten_date_array(params[:event],"start")
      end_time = Time.new *flatten_date_array(params[:event], "end")
      if end_time < start_time
        flash[:warning] = "Time invalid!"
        redirect_to event_path() and return
      end
      @event.update(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "events" SET "end_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["end_time", "2022-11-16 05:40:00"], ["updated_at", "2022-11-16 05:40:35.149926"], ["id", 23]]

  def destroy
    @event = Event.find(params[:id])
    if @event.user == current_user
      @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 27]]

  def add_participation
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      @event = Event.find(params[:id])
      if @event.user == current_user
        flash[:warning] = "You can't participate in your own event."
      elsif !@event.users.include?(current_user)
        # if @event.occupied_spots.nil?
        #   @event.occupied_spots = 1
        # end
        if @event.available_spots == 0 # @event.users.length >= @event.available_spots
          flash[:warning] = "Event #{@event.event_name} is full."
        else
          @event.users << current_user
          @event.available_spots = @event.available_spots - 1
          @event.occupied_spots = @event.occupied_spots + 1
          @event.save!
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "participations" ON "users"."id" = "participations"."user_id" WHERE "participations"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 22], ["id", 8], ["LIMIT", 1]]
UPDATE "events" SET "available_spots" = ?, "occupied_spots" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["available_spots", 0], ["occupied_spots", 4], ["updated_at", "2022-11-16 06:11:20.011958"], ["id", 22]]

  def remove_participation
    if !user_signed_in?
      redirect_to new_user_session_path
    else
      @event = Event.find(params[:id])
      if @event.users.include?(current_user)
        @event.users.delete(current_user)
        @event.available_spots = @event.available_spots + 1
        @event.occupied_spots = @event.occupied_spots - 1
        @event.save!
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" INNER JOIN "participations" ON "users"."id" = "participations"."user_id" WHERE "participations"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 23], ["id", 8], ["LIMIT", 1]]
UPDATE "events" SET "available_spots" = ?, "occupied_spots" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["available_spots", 1], ["occupied_spots", 3], ["updated_at", "2022-11-16 06:41:39.766936"], ["id", 22]]