app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "bio" = ?, "updated_at" = ?, "encrypted_password" = ? WHERE "users"."id" = ?  [["username", "123"], ["bio", "123"], ["updated_at", "2022-10-30 14:59:36.810513"], ["encrypted_password", "[FILTERED]"], ["id", 2]]

  def show_events_joined
    @events_joined = Participation.joins(:event).where(user_id: params[:id]).select("events.*")
---
SELECT events.* FROM "participations" INNER JOIN "events" ON "events"."id" = "participations"."event_id" WHERE "participations"."user_id" = ?  [["user_id", 6]]

  def show_events_posted
    @events_posted = Event.where(user_id: params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 6]]